In [1]:
import pandas as pd
titanic = pd.read_csv('titanic.csv')
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [2]:
age = titanic.age

In [3]:
age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [7]:
age.sort_values(ascending = False).head(3)

630    80.0
851    74.0
96     71.0
Name: age, dtype: float64

In [8]:
age.nlargest(3)

630    80.0
851    74.0
96     71.0
Name: age, dtype: float64

In [9]:
age.sort_values(ascending = True).head(3)

803    0.42
755    0.67
644    0.75
Name: age, dtype: float64

In [11]:
age.sort_values(ascending = True).iloc[:3]

803    0.42
755    0.67
644    0.75
Name: age, dtype: float64

In [13]:
age.nsmallest(3) #age of 3 youngest passengers

803    0.42
755    0.67
469    0.75
Name: age, dtype: float64

## idxmin() and idxmax()

In [14]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [16]:
#extract index of the oldest passenger
age.nlargest(3).index[0]

630

In [19]:
#extract index of the youngest passenger
age.nsmallest(3).index[0]

803

## idxmax() returns the row label of the maximum value

In [20]:
#easier way to do above steps
titanic.age.idxmax()

630

In [21]:
titanic.age.idxmin()

803

In [22]:
titanic.loc[630]

survived       1
pclass         1
sex         male
age           80
sibsp          0
parch          0
fare          30
embarked       S
deck           A
Name: 630, dtype: object

In [23]:
titanic.loc[titanic.age.idxmax()] #get info about the oldest passenger

survived       1
pclass         1
sex         male
age           80
sibsp          0
parch          0
fare          30
embarked       S
deck           A
Name: 630, dtype: object

In [24]:
titanic.loc[titanic.age.idxmin()] #get info about the youngest passenger

survived         1
pclass           3
sex           male
age           0.42
sibsp            0
parch            1
fare        8.5167
embarked         C
deck           NaN
Name: 803, dtype: object

In [30]:
dic = {'Mon':10,'Tue':25,'Wed':6,'Thurs':36,'Fri':2,'Sat':0,'Sun':None}
dic

{'Mon': 10, 'Tue': 25, 'Wed': 6, 'Thurs': 36, 'Fri': 2, 'Sat': 0, 'Sun': None}

In [31]:
sales = pd.Series(dic)

In [38]:
type(sales)

pandas.core.series.Series

In [32]:
sales

Mon      10.0
Tue      25.0
Wed       6.0
Thurs    36.0
Fri       2.0
Sat       0.0
Sun       NaN
dtype: float64

In [33]:
sales.sort_values(ascending = True)

Sat       0.0
Fri       2.0
Wed       6.0
Mon      10.0
Tue      25.0
Thurs    36.0
Sun       NaN
dtype: float64

In [35]:
sales.idxmin() #day with fewest sales

'Sat'

In [36]:
sales.sort_values(ascending = False)

Thurs    36.0
Tue      25.0
Mon      10.0
Wed       6.0
Fri       2.0
Sat       0.0
Sun       NaN
dtype: float64

In [37]:
sales.idxmax()

'Thurs'